In [50]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [51]:
data = pd.Series(np.random.randn(9),
                index=[list('aaabbccdd'), [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [52]:
data

a  1   -2.398750
   2    0.499355
   3   -1.373070
b  1    0.433065
   3    1.291287
c  1    0.248838
   2    0.270381
d  2    0.039016
   3   -0.326866
dtype: float64

In [53]:
data['a']

1   -2.398750
2    0.499355
3   -1.373070
dtype: float64

In [54]:
data['b']

1    0.433065
3    1.291287
dtype: float64

In [55]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [56]:
data

a  1   -2.398750
   2    0.499355
   3   -1.373070
b  1    0.433065
   3    1.291287
c  1    0.248838
   2    0.270381
d  2    0.039016
   3   -0.326866
dtype: float64

In [57]:
data['b']

1    0.433065
3    1.291287
dtype: float64

In [58]:
data.loc[['a', 'b']]

a  1   -2.398750
   2    0.499355
   3   -1.373070
b  1    0.433065
   3    1.291287
dtype: float64

In [59]:
data.loc[:, 2]

a    0.499355
c    0.270381
d    0.039016
dtype: float64

In [60]:
data.unstack()

          1         2         3
a -2.398750  0.499355 -1.373070
b  0.433065       NaN  1.291287
c  0.248838  0.270381       NaN
d       NaN  0.039016 -0.326866

In [61]:
data.unstack().stack()

a  1   -2.398750
   2    0.499355
   3   -1.373070
b  1    0.433065
   3    1.291287
c  1    0.248838
   2    0.270381
d  2    0.039016
   3   -0.326866
dtype: float64

In [62]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                    columns=[['Ohio', 'Ohio', 'Colorado'],
                            ['Green', 'Red', 'Green']])

In [63]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [64]:
frame['Ohio']['Green']['a']

1    0
2    3
Name: Green, dtype: int32

In [65]:
frame.index.names = ['key1', 'key2']

In [66]:
frame.columns.names = ['state', 'color']

In [67]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [68]:
frame['Colorado']

color      Green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

In [69]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                      names = ['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [70]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [71]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [72]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [73]:
frame.sort_index(level=1) # 对index进行排序 指定index的层级

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [74]:
frame = frame.sort_index(level=0)

In [75]:
frame = frame.swaplevel('key1', 'key2')

In [76]:
frame

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [77]:
frame.swaplevel?

In [78]:
frame.sort_index?

In [79]:
frame.sum(level='key2')

C:\Users\zhaolei\AppData\Local\Temp/ipykernel_19544/2004046222.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [80]:
frame.sum(level='color', axis=1)

C:\Users\zhaolei\AppData\Local\Temp/ipykernel_19544/4133796543.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='color', axis=1)

color      Green  Red
key2 key1
1    a         2    1
2    a         8    4
1    b        14    7
2    b        20   10

In [81]:
frame

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [82]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                     'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd': [0, 1, 2, 0, 1, 2, 3]})

In [83]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [84]:
frame2 = frame.set_index(['c', 'd'])  # ???

In [85]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [86]:
frame.set_index(['c', 'd'], drop=False) # ????

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [87]:
frame.set_index?

In [88]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
...                    'year': [2012, 2014, 2013, 2014],
...                    'sale': [55, 40, 84, 31]})

In [89]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [90]:
df.set_index(['month'])

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [91]:
df.set_index(['month', 'year'], inplace=True)

In [92]:
df # month 和 year 都是index 的names 不可以直接访问

            sale
month year
1     2012    55
4     2014    40
7     2013    84
10    2014    31

In [93]:
df.loc[1, 2012] # 重复索引

sale    55
Name: (1, 2012), dtype: int64

In [94]:
df

            sale
month year
1     2012    55
4     2014    40
7     2013    84
10    2014    31

In [95]:
df.loc[4]

      sale
year
2014    40

In [97]:
df.unstack()

       sale
year   2012  2013  2014
month
1      55.0   NaN   NaN
4       NaN   NaN  40.0
7       NaN  84.0   NaN
10      NaN   NaN  31.0

In [98]:
df

            sale
month year
1     2012    55
4     2014    40
7     2013    84
10    2014    31

In [99]:
df

            sale
month year
1     2012    55
4     2014    40
7     2013    84
10    2014    31

In [100]:
df1 = pd.DataFrame({'key': list('bbacaab'),
                   'data1': range(7)})

In [101]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [102]:
df2 = pd.DataFrame({'key': list('abd'),
                   'data2': range(3)})

In [103]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [104]:
pd.merge(df1, df2) # 默认采用inner方式 参数how

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [105]:
pd.merge(df1, df2, on='key', how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [106]:
df3 = pd.DataFrame({'lkey': list('bbacaab'),
                   'data1': range(7)})

In [107]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [108]:
df4 = pd.DataFrame({'rkey': list('abd'),
                  'data2': range(3)})

In [109]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [110]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='left') # 不相同的列不会合并 如果相同则会合并

  lkey  data1 rkey  data2
0    b      0    b    1.0
1    b      1    b    1.0
2    a      2    a    0.0
3    c      3  NaN    NaN
4    a      4    a    0.0
5    a      5    a    0.0
6    b      6    b    1.0

In [111]:
df5 = pd.DataFrame({'key': list('bbacab'),
                  'data1': range(6)})

In [112]:
df6 = pd.DataFrame({'key': list('ababd'),
                   'data2': range(5)})

In [113]:
df5.merge(df6, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [114]:
pd.merge(df5, df6, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [115]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                    'key2': ['one', 'two', 'one'],
                    'lval': [1, 2, 3]})

In [116]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                    'key2': ['one', 'one', 'one', 'two'],
                    'rval': range(4, 8)})

In [117]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [118]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [119]:
pd.merge(left, right, on='key1', how='outer') # 原有的非合并的重复列系统会自动添加后缀 x y

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [120]:
pd.merge(left, right, on='key1', how='outer', suffixes=('_left', '_right'), sort=False, indicator=True)

  key1 key2_left  lval key2_right  rval _merge
0  foo       one     1        one     4   both
1  foo       one     1        one     5   both
2  foo       two     2        one     4   both
3  foo       two     2        one     5   both
4  bar       one     3        one     6   both
5  bar       one     3        two     7   both

In [121]:
left1 = pd.DataFrame({'key': list('abaabc'),
                     'value': range(6)})

In [122]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [123]:
right1

   group_val
a        3.5
b        7.0

In [124]:
pd.merge(left1, right1, left_on='key', right_index=True) # 使用右侧的index索引行进行匹配

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [125]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                     'key2': [2000, 2001, 2002, 2001, 2002],
                     'data': np.arange(5.)})

In [126]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [127]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                     index=[['Nevada', 'Ohio', 'Ohio', 'Nevada', 'Ohio', 'Ohio'],
                           [2001, 2000, 2000, 2000, 2001, 2002]])

In [128]:
righth

              0   1
Nevada 2001   0   1
Ohio   2000   2   3
       2000   4   5
Nevada 2000   6   7
Ohio   2001   8   9
       2002  10  11

In [129]:
righth.loc['Nevada']

      0  1
2001  0  1
2000  6  7

In [130]:
righth.index.names = ['name', 'year']

In [131]:
righth

              0   1
name   year
Nevada 2001   0   1
Ohio   2000   2   3
       2000   4   5
Nevada 2000   6   7
Ohio   2001   8   9
       2002  10  11

In [132]:
righth.swaplevel('name', 'year')

              0   1
year name
2001 Nevada   0   1
2000 Ohio     2   3
     Ohio     4   5
     Nevada   6   7
2001 Ohio     8   9
2002 Ohio    10  11

In [133]:
righth.sort_index(axis=0, level=0)

              0   1
name   year
Nevada 2000   6   7
       2001   0   1
Ohio   2000   2   3
       2000   4   5
       2001   8   9
       2002  10  11

In [134]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [135]:
righth

              0   1
name   year
Nevada 2001   0   1
Ohio   2000   2   3
       2000   4   5
Nevada 2000   6   7
Ohio   2001   8   9
       2002  10  11

In [136]:
pd.merge(lefth, righth, left_on = ['key1', 'key2'], right_index=True) # 借助右侧的多层索引作为键 左侧匹配必须传入相同长度的多级列表

     key1  key2  data   0   1
0    Ohio  2000   0.0   2   3
0    Ohio  2000   0.0   4   5
1    Ohio  2001   1.0   8   9
2    Ohio  2002   2.0  10  11
3  Nevada  2001   3.0   0   1

In [137]:
pd.merge(lefth, righth, left_on = ['key1', 'key2'], right_index=True, how='outer')

     key1  key2  data     0     1
0    Ohio  2000   0.0   2.0   3.0
0    Ohio  2000   0.0   4.0   5.0
1    Ohio  2001   1.0   8.0   9.0
2    Ohio  2002   2.0  10.0  11.0
3  Nevada  2001   3.0   0.0   1.0
4  Nevada  2002   4.0   NaN   NaN
4  Nevada  2000   NaN   6.0   7.0

In [138]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                    index=list('ace'),
                    columns=["Ohio", 'Nevada'])

In [139]:
right2 = pd.DataFrame([[7., 8.], [3., 4.], [5., 6.], [11., 12.]],
                     index=list('bcde'),
                     columns=['Missouri', 'Alabama'])

In [140]:
right2

   Missouri  Alabama
b       7.0      8.0
c       3.0      4.0
d       5.0      6.0
e      11.0     12.0

In [141]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       3.0      4.0
d   NaN     NaN       5.0      6.0
e   5.0     6.0      11.0     12.0

In [142]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [143]:
left2.join(right2, how='outer') # 按照索引进行外键连接

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       3.0      4.0
d   NaN     NaN       5.0      6.0
e   5.0     6.0      11.0     12.0

In [144]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [145]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [146]:
right1

   group_val
a        3.5
b        7.0

In [147]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [148]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                      index=list('acef'),
                      columns=['New York', 'Oregon'])

In [149]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [151]:
left2.join([left1, another], how='outer')

   Ohio  Nevada  key  value  New York  Oregon
0   NaN     NaN    a    0.0       NaN     NaN
1   NaN     NaN    b    1.0       NaN     NaN
2   NaN     NaN    a    2.0       NaN     NaN
3   NaN     NaN    a    3.0       NaN     NaN
4   NaN     NaN    b    4.0       NaN     NaN
5   NaN     NaN    c    5.0       NaN     NaN
a   1.0     2.0  NaN    NaN       7.0     8.0
c   3.0     4.0  NaN    NaN       9.0    10.0
e   5.0     6.0  NaN    NaN      11.0    12.0
f   NaN     NaN  NaN    NaN      16.0    17.0

In [152]:
arr = np.arange(12).reshape(3, 4)

In [153]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [155]:
np.concatenate([arr, arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [156]:
np.concatenate?

In [157]:
s1 = pd.Series([0, 1], index=['a', 'b'])

In [158]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

In [159]:
s3 = pd.Series([5, 6], index=['f', 'g'])

In [160]:
s1

a    0
b    1
dtype: int64

In [161]:
s2

c    2
d    3
e    4
dtype: int64

In [162]:
s3

f    5
g    6
dtype: int64

In [163]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [164]:
pd.concat([s1, s2, s3], axis=1) # 每个Series都可以作为一列 因此有3列

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [165]:
s4 = pd.concat([s1, s3])

In [166]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [167]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [168]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [169]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [170]:
pd.concat?

In [171]:
df

            sale
month year
1     2012    55
4     2014    40
7     2013    84
10    2014    31

In [172]:
df.to_markdown()

ImportError: Missing optional dependency 'tabulate'.  Use pip or conda to install tabulate.

In [173]:
pd.__version__

'1.3.4'

In [174]:
result = pd.concat([s1, s1])

In [175]:
result

a    0
b    1
a    0
b    1
dtype: int64

In [176]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [177]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [178]:
result['one']

a    0
b    1
dtype: int64

In [179]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [180]:
result = pd.concat([s1, s1, s3], axis=1, keys=['one', 'two', 'three'])

In [181]:
result

   one  two  three
a  0.0  0.0    NaN
b  1.0  1.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [182]:
result.columns

Index(['one', 'two', 'three'], dtype='object')

In [183]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                  columns=['one', 'two'])

In [184]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                  columns=['three', 'four'])

In [185]:
df2

   three  four
a      5     6
c      7     8

In [186]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [193]:
res = pd.concat([df1, df2], axis=1, keys=['level1', 'level2']) # 对合并的列进行标记 分层索引

In [194]:
res

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [195]:
res['level1']

   one  two
a    0    1
b    2    3
c    4    5

In [196]:
pd.concat({'key1': df1, "key2": df2}) # 字典的键会自动和keys配对

        one  two  three  four
key1 a  0.0  1.0    NaN   NaN
     b  2.0  3.0    NaN   NaN
     c  4.0  5.0    NaN   NaN
key2 a  NaN  NaN    5.0   6.0
     c  NaN  NaN    7.0   8.0

In [201]:
res = pd.concat([df1, df2], axis=1, keys=['level1', 'level2'], names=['upper', 'lower'])

In [203]:
res.columns.names

FrozenList(['upper', 'lower'])

In [204]:
res

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [205]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

In [206]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [207]:
pd.concat([df1, df2], ignore_index=True) # 重置索引

          a         b         c         d
0 -0.779512 -0.281933  0.929976 -0.247689
1 -1.491152  0.836114  1.003862 -0.697293
2  0.466860  2.201209 -0.771695 -1.318487
3  0.476864  0.101814       NaN -0.775943
4 -1.399677  1.039148       NaN  0.312250

In [208]:
pd.concat([df1, df2], ignore_index=True, join='inner') # 重置索引

          a         b         d
0 -0.779512 -0.281933 -0.247689
1 -1.491152  0.836114 -0.697293
2  0.466860  2.201209 -1.318487
3  0.476864  0.101814 -0.775943
4 -1.399677  1.039148  0.312250

In [223]:
res = pd.concat([df1, df2], axis=1, keys=['level1', 'level2', 'fuck'], names=['upper', 'lower'])

In [224]:
res

upper    level1                                  level2
lower         a         b         c         d         b         d         a
0     -0.779512 -0.281933  0.929976 -0.247689  0.101814 -0.775943  0.476864
1     -1.491152  0.836114  1.003862 -0.697293  1.039148  0.312250 -1.399677
2      0.466860  2.201209 -0.771695 -1.318487       NaN       NaN       NaN

In [255]:
a = pd.Series([np.nan, 2.5, 0.0, np.nan, np.nan, np.nan],
             index=['f', 'e', 'd', 'c', 'b', 'a'])

In [256]:
b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.],
             index=['a', 'b', 'c', 'd', 'e', 'f'])

In [257]:
a

f    NaN
e    2.5
d    0.0
c    NaN
b    NaN
a    NaN
dtype: float64

In [258]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [259]:
np.where(pd.isnull(a), b, a) # 根据内部的索引值进行取舍的

array([0. , 2.5, 0. , nan, nan, 5. ])

In [260]:
pd.isnull(a)

f     True
e    False
d    False
c     True
b     True
a     True
dtype: bool

In [261]:
b.combine_first(a)

a    0.0
b    NaN
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [262]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [254]:
a

f    NaN
e    2.5
d    0.0
c    NaN
b    4.5
a    NaN
dtype: float64